app/views/users/custom/index.html.erb

SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 1]]
---
          <td><%= user.phone_number%></td>
          <td><%= user.roles.collect(&:name).collect(&:titleize).join(', ')%></td>