app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = ?  [["user_id", 13]]
---
  def my_list
    @properties = current_user.properties.all

SELECT "properties".* FROM "properties" WHERE (name LIKE '%satti%' OR state LIKE '%satti%' OR location LIKE '%satti%' OR property_type LIKE '%satti%')
---
  def search
    key = "%#{params[:query]}%"

    @properties = Property.where('name LIKE :search OR state LIKE :search OR location LIKE :search OR property_type LIKE :search', search: key)

INSERT INTO "properties" ("name", "state", "country", "map_position", "property_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @property = current_user.properties.new(property_params)

    respond_to do |format|
      if @property.save