app/controllers/users_controller.rb

  def create_customer

    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "full_name", "phone_number", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)